Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC01/include/pic32ck2051gc01064.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M33 handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  void* pfnSecureFaultMonitor_Handler;           /*  -9 Secure Fault */
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnFCR_ERR_Handler;                      /*   0 Flash Read Controller (FCR) (FCR) */
  void* pfnFCR_FLT_Handler;                      /*   1 Flash Read Controller (FCR) (FCR) */
  void* pfnFCW_Handler;                          /*   2 Flash Write Control (FCW) (FCW) */
  void* pfnPM_Handler;                           /*   3 Power Manager (PM) */
  void* pfnSUPC_Handler;                         /*   4 Supply Controller (SUPC) */
  void* pfnOSCCTRL_XOSC_Handler;                 /*   5 Oscillators Control (OSCCTRL) */
  void* pfnOSCCTRL_DFLL_Handler;                 /*   6 Oscillators Control (OSCCTRL) */
  void* pfnOSCCTRL_PLL0_Handler;                 /*   7 Oscillators Control (OSCCTRL) */
  void* pfnOSC32KCTRL_Handler;                   /*   8 32kHz Oscillators Control (OSC32KCTRL) */
  void* pfnMCLK_Handler;                         /*   9 Main Clock (MCLK) */
  void* pfnFREQM_Handler;                        /*  10 Frequency Meter (FREQM) */
  void* pfnWDT_Handler;                          /*  11 Watchdog Timer (WDT) */
  void* pfnRTC_Handler;                          /*  12 Real-Time Counter (RTC) */
  void* pfnEIC_EXTINT_0_Handler;                 /*  13 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_1_Handler;                 /*  14 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_2_Handler;                 /*  15 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_3_Handler;                 /*  16 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_4_Handler;                 /*  17 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_5_Handler;                 /*  18 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_6_Handler;                 /*  19 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_7_Handler;                 /*  20 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_8_Handler;                 /*  21 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_9_Handler;                 /*  22 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_10_Handler;                /*  23 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_11_Handler;                /*  24 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_12_Handler;                /*  25 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_13_Handler;                /*  26 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_14_Handler;                /*  27 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_15_Handler;                /*  28 External Interrupt Controller (EIC) */
  void* pfnEIC_NSCHK_Handler;                    /*  29 External Interrupt Controller (EIC) */
  void* pfnPAC_Handler;                          /*  30 Peripheral Access Controller (PAC) */
  void* pfnTRAM_Handler;                         /*  31 TrustRAM (TRAM) */
  void* pfnPORT_Handler;                         /*  32 Port Module (PORT) */
  void* pfnDMA0_PRI0_Handler;                    /*  33 Direct Memory Access Controller (DMA0) */
  void* pfnDMA0_PRI1_Handler;                    /*  34 Direct Memory Access Controller (DMA0) */
  void* pfnDMA0_PRI2_Handler;                    /*  35 Direct Memory Access Controller (DMA0) */
  void* pfnDMA1_PRI0_Handler;                    /*  36 Direct Memory Access Controller (DMA1) */
  void* pfnDMA1_PRI1_Handler;                    /*  37 Direct Memory Access Controller (DMA1) */
  void* pfnHMATRIX_Handler;                      /*  38 HSB Matrix (HMATRIX) */
  void* pfnEVSYS_0_Handler;                      /*  39 Event System Interface (EVSYS) */
  void* pfnEVSYS_1_Handler;                      /*  40 Event System Interface (EVSYS) */
  void* pfnEVSYS_2_Handler;                      /*  41 Event System Interface (EVSYS) */
  void* pfnEVSYS_3_Handler;                      /*  42 Event System Interface (EVSYS) */
  void* pfnEVSYS_OTHER_Handler;                  /*  43 Event System Interface (EVSYS) */
  void* pfnSERCOM0_56_Handler;                   /*  44 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_0_Handler;                    /*  45 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_1_Handler;                    /*  46 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_2_Handler;                    /*  47 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_3_Handler;                    /*  48 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_4_Handler;                    /*  49 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_56_Handler;                   /*  50 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_0_Handler;                    /*  51 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_1_Handler;                    /*  52 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_2_Handler;                    /*  53 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_3_Handler;                    /*  54 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_4_Handler;                    /*  55 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_56_Handler;                   /*  56 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_0_Handler;                    /*  57 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_1_Handler;                    /*  58 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_2_Handler;                    /*  59 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_3_Handler;                    /*  60 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_4_Handler;                    /*  61 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM3_56_Handler;                   /*  62 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_0_Handler;                    /*  63 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_1_Handler;                    /*  64 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_2_Handler;                    /*  65 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_3_Handler;                    /*  66 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM3_4_Handler;                    /*  67 Serial Communication Interface (SERCOM3) */
  void* pfnTCC0_OTHER_Handler;                   /*  68 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC_0_Handler;                    /*  69 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC_1_Handler;                    /*  70 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC_2_Handler;                    /*  71 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC_3_Handler;                    /*  72 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC_4_Handler;                    /*  73 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC0_MC_5_Handler;                    /*  74 Timer Counter for Control Applications (TCC0) */
  void* pfnTCC1_OTHER_Handler;                   /*  75 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC_0_Handler;                    /*  76 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC_1_Handler;                    /*  77 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC_2_Handler;                    /*  78 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC_3_Handler;                    /*  79 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC_4_Handler;                    /*  80 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC1_MC_5_Handler;                    /*  81 Timer Counter for Control Applications (TCC1) */
  void* pfnTCC2_OTHER_Handler;                   /*  82 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC_0_Handler;                    /*  83 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC_1_Handler;                    /*  84 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC_2_Handler;                    /*  85 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC_3_Handler;                    /*  86 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC_4_Handler;                    /*  87 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC2_MC_5_Handler;                    /*  88 Timer Counter for Control Applications (TCC2) */
  void* pfnTCC3_OTHER_Handler;                   /*  89 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC_0_Handler;                    /*  90 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC_1_Handler;                    /*  91 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC_2_Handler;                    /*  92 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC_3_Handler;                    /*  93 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC_4_Handler;                    /*  94 Timer Counter for Control Applications (TCC3) */
  void* pfnTCC3_MC_5_Handler;                    /*  95 Timer Counter for Control Applications (TCC3) */
  void* pfnSERCOM4_56_Handler;                   /*  96 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_0_Handler;                    /*  97 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_1_Handler;                    /*  98 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_2_Handler;                    /*  99 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_3_Handler;                    /* 100 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM4_4_Handler;                    /* 101 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM5_56_Handler;                   /* 102 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_0_Handler;                    /* 103 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_1_Handler;                    /* 104 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_2_Handler;                    /* 105 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_3_Handler;                    /* 106 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM5_4_Handler;                    /* 107 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM6_56_Handler;                   /* 108 Serial Communication Interface (SERCOM6) */
  void* pfnSERCOM6_0_Handler;                    /* 109 Serial Communication Interface (SERCOM6) */
  void* pfnSERCOM6_1_Handler;                    /* 110 Serial Communication Interface (SERCOM6) */
  void* pfnSERCOM6_2_Handler;                    /* 111 Serial Communication Interface (SERCOM6) */
  void* pfnSERCOM6_3_Handler;                    /* 112 Serial Communication Interface (SERCOM6) */
  void* pfnSERCOM6_4_Handler;                    /* 113 Serial Communication Interface (SERCOM6) */
  void* pfnSERCOM7_56_Handler;                   /* 114 Serial Communication Interface (SERCOM7) */
  void* pfnSERCOM7_0_Handler;                    /* 115 Serial Communication Interface (SERCOM7) */
  void* pfnSERCOM7_1_Handler;                    /* 116 Serial Communication Interface (SERCOM7) */
  void* pfnSERCOM7_2_Handler;                    /* 117 Serial Communication Interface (SERCOM7) */
  void* pfnSERCOM7_3_Handler;                    /* 118 Serial Communication Interface (SERCOM7) */
  void* pfnSERCOM7_4_Handler;                    /* 119 Serial Communication Interface (SERCOM7) */
  void* pfnTCC4_OTHER_Handler;                   /* 120 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC4_MC_0_Handler;                    /* 121 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC4_MC_1_Handler;                    /* 122 Timer Counter for Control Applications (TCC4) */
  void* pfnTCC5_OTHER_Handler;                   /* 123 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC5_MC_0_Handler;                    /* 124 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC5_MC_1_Handler;                    /* 125 Timer Counter for Control Applications (TCC5) */
  void* pfnTCC6_OTHER_Handler;                   /* 126 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC6_MC_0_Handler;                    /* 127 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC6_MC_1_Handler;                    /* 128 Timer Counter for Control Applications (TCC6) */
  void* pfnTCC7_OTHER_Handler;                   /* 129 Timer Counter for Control Applications (TCC7) */
  void* pfnTCC7_MC_0_Handler;                    /* 130 Timer Counter for Control Applications (TCC7) */
  void* pfnTCC7_MC_1_Handler;                    /* 131 Timer Counter for Control Applications (TCC7) */
  void* pfnADC_0_Handler;                        /* 132 ADC Controller (ADC) */
  void* pfnADC_1_Handler;                        /* 133 ADC Controller (ADC) */
  void* pfnADC_2_Handler;                        /* 134 ADC Controller (ADC) */
  void* pfnADC_3_Handler;                        /* 135 ADC Controller (ADC) */
  void* pfnADC_4_Handler;                        /* 136 ADC Controller (ADC) */
  void* pfnADC_5_Handler;                        /* 137 ADC Controller (ADC) */
  void* pfnAC_Handler;                           /* 138 Analog Comparator Controller (AC) */
  void* pfnPTC_Handler;                          /* 139 Peripheral Touch Controller (PTC) */
  void* pfnSPI_IXS_Handler;                      /* 140 Audio SPI with 8 channels compatibilty (SPI_IXS) */
  void* pfnPCC_Handler;                          /* 141 Parallel Capture Controller (PCC) */
  void* pfnPDEC_Handler;                         /* 142 Position Decoder (PDEC) */
  void* pfnCAN0_Handler;                         /* 143 Control Area Network (CAN0) */
  void* pfnCAN1_Handler;                         /* 144 Control Area Network (CAN1) */
  void* pfnETH_Handler;                          /* 145 Ethernet Controller (ETH) */
  void* pfnSQI_Handler;                          /* 146 Polaris Serial Quad Interface SIB (SQI) */
  void* pfnTRNG_Handler;                         /* 147 True Random Generator (TRNG) */
  void* pfnSDMMC0_Handler;                       /* 148 SD/MMC Host Controller (SDMMC0) */
  void* pfnSDMMC1_Handler;                       /* 149 SD/MMC Host Controller (SDMMC1) */
  void* pfnUSB_OTHER_Handler;                    /* 150 Full-Speed Universal Serial Bus (USB) */
  void* pfnUSB_SOF_Handler;                      /* 151 Full-Speed Universal Serial Bus (USB) */
  void* pfnUSB_TRCPT0_Handler;                   /* 152 Full-Speed Universal Serial Bus (USB) */
  void* pfnUSB_TRCPT1_Handler;                   /* 153 Full-Speed Universal Serial Bus (USB) */
  void* pfnUSBHS_Handler;                        /* 154 USB High Speed (USBHS) */
} DeviceVectors;

